package com.company.day08;

/**
 * 学生类，是一个模版，描述了所有学生的共同特征[状态+行为]
 * 当前类只描述学生的状态信息【属性】
 */

//student01是类，属于引用数据类型
public class Student01 {

    //类体=属性+方法

    //属性[存储数据采用变量的形式]
    //由于变量定义在类体中，方法体之外，这种变量称为成员变量

    //所有学生都有学号信息
    //但是每一个学生的学号都是不同的
    //所以要访问这个学号必须创建对象，通过对象去访问学号信息
    //学号信息不能直接通过"类"去访问，所以这种成员变量又被叫做：实例变量
    //对象又被称为实例，实例变量又被称为对象变量，[对象级别的变量]
    //不创建对象，这个no变量的内存空间是不存在的，只有创建了对象，这个no变量内存空间才会创建

    //学号
    int no;

    //姓名
    String name;

    //年龄
    int age;

    //性别
    boolean sex;

    //住址
    String address;
}
